using EpicTextQuest2D;

Felix felix = new Felix(100, 100, 20, 0, 1, 1);
Enemy enemy = new Enemy(100, 100, 10, 1, 1);
Floor1 floor1 = new Floor1();
List <Skills> skills = new List<Skills>();
Skills burning_servants = new Skills("Пылающие слуги", "«Используя магию огня, я могу создать огненных существ, которые атакуют всех вокруг меня.»", 15 + felix.Advantage,5,0);
Skills thunder_kick = new Skills("Молниеносный пинок", "«Магия молнии способна помочь мне нанести сокрушающий и молниеносный удар противнику.»", 25 + (felix.Advantage * 1.5),10,0);
Skills grand_javelin = new Skills("Великолепное копье", "«Воспользовавшись магией молнии, я знаю как материализовать что-то наподобие копья, которое всегда найдет свой путь к противнику и поразит его с невероятной скоростью.»", 30 + (felix.Advantage * 2),15,0);
Skills shadow_intervention = new Skills("Теневое вмешательство", "«Тени могут изменить темп битвы, вцепившись в противника, обездвижив его, после чего они резко вырвут свои когти, оставляя глубокие раны, напитывая меня вражеской кровью.»", 40 + felix.Advantage, 17,20);
Skills rejected_by_flame = new Skills("Отвергнутый огнем", "«Сконцентрировав всю магию огня в себе, начнется резкое её отторжение, нанося урон всему и даже мне.»", 30 * (felix.Advantage / 2), 20, -10);
skills.Add(burning_servants);
skills.Add(thunder_kick);
skills.Add(grand_javelin);
skills.Add(shadow_intervention);
skills.Add(rejected_by_flame);
string[][] layout = new string[4][];
layout[0] = new string[] { "[1]", " ", " ", " " };
layout[1] = new string[] { " ", "[ ]", " ", " " };
layout[2] = new string[] { " ", " ", "[ ]", " " };
layout[3] = new string[] { " ", " ", " ", "[*]" };

// дебаг тул
bool debug = true;
while (debug)
{
    var x = Console.ReadLine();
    Console.Clear();
    switch (x)
    {
        case "0":
            felix.Health -= 10;
            break;
        case "1":
            felix.Health += 10;
            break;
        case "2":
            felix.MaxHealth -= 10;
            break;
        case "3":
            felix.MaxHealth += 10;
            break;
        case "4":
            TurnEnd();
            break;
        case "5":
            felix.Health = 100;
            felix.Stamina = 20;
            enemy.Health = 100;
            enemy.Stamina = 10;
            Fightsequence();
            break;
        case "6":
            felix.Stamina -= 10;
            break;
        case "7":
            felix.Stamina += 10;
            break;
        case "8":
            felix.Advantage -= 2;
            break;
        case "9":
            felix.Advantage += 2;
            break;
        case "10":
            foreach (string[] lay in layout)
            {
                foreach (string lay2 in lay)
                {
                    Console.Write($"{lay2}  ");
                }
                Console.WriteLine();
            }
            break;
        case "11":
            Traversing();
            break;
        case "-":
            debug = false;
            break;
        default:
            Console.WriteLine("Лист доступных функций: \n" +
                "0 - убрать 10 хп\n" +
                "1 - добавить 10 хп\n" +
                "2 - убрать 10 макс хп\n" +
                "3 - добавить 10 макс хп\n" +
                "4 - проверка функции Закончить Ход\n" +
                "5 - тестовый бой\n" +
                "6 - убавить стамину на 10\n" +
                "7 - добавить стамину на 10\n" +
                "8 - убавить 2 очка преимущества\n" +
                "9 - добавить 2 очка преимущества\n" +
                "10 - показать этаж\n" +
                "11 - передвижение\n"+
                "- - выйти из дебага");
            break;

    }
    // чтобы не показывало статы когда выходишь из дебага
    if (debug)
    {
        Console.WriteLine($"Здоровье: {felix.Health}/{felix.MaxHealth}\n" +
            $"Выносливость: {felix.Stamina}/20\n" +
            $"Преимущество Феликса: {felix.Advantage}");
    }
}
void Attack ()
{
    int dmgfelix = Random.Shared.Next(1, 20) + felix.Advantage;
    int dmgenemy = Random.Shared.Next(1, 20);
    if (dmgfelix > dmgenemy)
    {
        if ((dmgfelix > 1) && (dmgfelix < 5))
        {
            Console.WriteLine($"Успешно! Ты нанес противнику {dmgfelix} единицы урона!\nТы чувствуешь себя менее напряженным.");
        }
        else if ((dmgfelix >= 5) && (dmgfelix <= 10))
        {
            Console.WriteLine($"Успешно! Ты нанес противнику {dmgfelix} единиц урона!\nТы чувствуешь как часть сил вернулась к тебе.");
        }
        else if ((dmgfelix > 10) && (dmgfelix <= 19))
        {
            Console.WriteLine($"Успешно! Ты нанес противнику {dmgfelix} единиц урона!\nТвоя кровь начинает бегать по телу гораздо активнее,\nбудто заранее подготавливая твое тело к атаке гораздо сильнее этой.");
        }
        else
        {
            Console.WriteLine($"Успешно! Ты нанес противнику зубодробительные {dmgfelix} единиц урона!!\nТы ощущаешь великий прилив сил.\nМожет ты способен нанести разрушительную атаку?");
        }
            enemy.Health -= dmgfelix;
        felix.Stamina += dmgfelix;
    }
    else if (dmgfelix < dmgenemy) 
    {
        if ((dmgenemy > 1) && (dmgenemy < 5))
        {
            Console.WriteLine($"Ух... Твоя атака не смогла сравниться с легким шлепком от противника.\nУ него получилось нанести {dmgenemy} единицы урона.\nНа его лице появилась легкая гримаса улыбки.");
        }
        else if ((dmgenemy >= 5) && (dmgenemy <= 10))
        {
            Console.WriteLine($"Ой... Противник успел увидеть твою атаку и, увернувшись, нанес ответный удар.\nУ него получилось нанести {dmgenemy} единиц урона.\nЕго кулак покрылся твоей кровью и ты видишь как он довольствуется собой.");
        }
        else if ((dmgenemy > 10) && (dmgenemy <= 19))
        {
            Console.WriteLine($"Ай-ай-ай... Твоя атака не смогла превзойти мощь противника.\nУ него получилось нанести {dmgenemy} единиц урона.\nТвоя кровь хлестнула на пол, а спокойное выражение лица противника пропало, оно сменилось маниакальной улыбкой.\nТы думаешь что с этой битвой надо покончить как можно быстрее, пока все силы не покинули тебя.");
        }
        else
        {
            Console.WriteLine("ХРУСТ......");
            Console.ReadKey();
            Console.WriteLine($"В твоих глазах потемнело на пару секунд, но противник не решил этим воспользоваться.\nОн нанес уничтожающие {dmgenemy} единиц урона!!!\nТы удивлен как ты все еще стоишь на ногах, но не решаешь тратить время на раздумия.\n«Сначала надо покончить с битвой и только потом заботиться о переломах» подумал ты про себя");
        }
        felix.Health -= dmgenemy;
        enemy.Stamina += dmgenemy;
    }
    else
    {
        Console.WriteLine($"КЛАЦ! Ваши оружия сцепились.\nВам обоим выпало {dmgfelix} и никто не попал, но вы оба почувствовали и собственные удары, и удары друг друга.\nЭто сильно сказалось на ваших силах.");
        enemy.Stamina -= dmgenemy / 2;
        felix.Stamina -= dmgfelix / 2;
    }
    Console.ReadKey();
    Console.Clear();
}
void Block()
{
    int dmgenemy = Random.Shared.Next(1, 20);
    felix.Health = felix.Health * 2;
    felix.Health -= dmgenemy;
    felix.Health = felix.Health / 2;
    if (dmgenemy == 1)
    {
        Console.WriteLine($"Враг нанес тебе 1 единицу урона, но ты этого даже не почуствовал.");
    }
    else if ((dmgenemy > 1) && (dmgenemy < 5))
    {
        Console.WriteLine($"Враг нанес тебе {dmgenemy} единицы урона, но ты почусвовал всего половину его удара.");
    }
    else if (dmgenemy >= 5)
    {
        Console.WriteLine($"Враг нанес тебе {dmgenemy} единиц урона, но ты почусвовал всего половину его удара.");
    }
    Console.ReadKey();
}
// Функция для заканчивания хода с функцией распада хп выше максимального
void TurnEnd () {
    int HPOverflow;
    if (felix.Health > felix.MaxHealth)
    {
        HPOverflow = felix.Health - felix.MaxHealth;
        
        felix.Health -= (int)HPOverflow / 2;
        //В случае если пытается разделить 1 на 2, то будет сохраняться 1 лишнее хп, поэтому вычитается 1 лишнее хп
        if (HPOverflow == 1) {
            felix.Health -= 1;
        }
    }
    Console.Clear();
}


void Fightsequence()
{
    felix.AtkAmmount = felix.MaxAtkAmmount;
    while (felix.Health > 0 && enemy.Health > 0)
    {
        do
        {
            Console.WriteLine("Перед вами стоит противник, что вы собираетесь сделать?");
            Console.WriteLine("1 - Атаковать\n" +
            "2 - Способности\n" +
            "3 - Защититься\n" +
            "4 - Осмотреться");
            var fightchoice = Console.ReadLine();
            Console.Clear();
            switch (fightchoice)
            {
                case "1":
                    Attack();
                    break;
                case "2":
                //сначала выводит названия скиллов, потом игрок выбирает один, смотрит описание, сколько выносливости затратит и сколько урона нанесет, после чего игрок либо подтверждает выбор скилла, либо возвращается.
                skillchoice:
                    Console.WriteLine("«Способности которые я знаю:");
                    foreach (var skill in skills)
                    {
                        Console.WriteLine($"- {skill.SkillName}");
                    }
                    Console.WriteLine("Но какую выбрать?» (написать полное название)");
                    string skillname = Console.ReadLine();
                    Console.Clear();
                    if (skills.Any(x => x.SkillName == skillname) && skills.Where(x => x.SkillName == skillname).First().Cost < felix.Stamina)
                    {
                        skills.Where(x => x.SkillName == skillname).First().SkillUse();
                        var skillchoice = Console.ReadLine();
                        skillchoice = skillchoice.ToUpperInvariant();
                        skillconfirm:
                        switch (skillchoice)
                        { 
                            case "Д":
                            enemy.Health -= skills.Where(x => x.SkillName == skillname).First().Damage;
                            felix.Stamina -= skills.Where(x => x.SkillName == skillname).First().Cost;
                            felix.Health += skills.Where(x => x.SkillName == skillname).First().Heal;
                            Console.WriteLine($"«Получилось. Судя по всему противник это не оценил, но да ладно, главное что это приблизило меня к победе.»");
                            Console.ReadKey();
                            Console.Clear();
                            break;
                        case "Н":
                            Console.Clear();
                            goto skillchoice;
                        default:
                            Console.Clear();
                            Console.WriteLine("«Посреди боя трудно собраться с мыслями, попробую еще раз.»");
                            Console.ReadKey();
                            Console.Clear();
                            goto skillconfirm;
                        }
                    }
                    else if (skills.Where(x => x.SkillName == skillname).First().Cost > felix.Stamina)
                    {
                        Console.Clear();
                        Console.WriteLine("«Я боюсь что если я попытаюсь использовать эту способность, мои ноги перестанут держать меня.»\n«Может мне лучше использовать обычную атаку?»");
                        Console.ReadKey();
                        Console.Clear();
                    }
                    else if (skills.Any(x => x.SkillName != skillname))
                    {
                        Console.Clear();
                        Console.WriteLine("«Неужели я так сильно изнеможен, что не могу нормально вспомнить название своих способностей?»");
                        Console.ReadKey();
                        Console.Clear();
                        goto skillchoice;
                    }

                    break;
                case "3":
                    Block();
                    break;
                case "4":
                    Console.WriteLine($"Ты осматриваешь свое тело на наличие ран.\nТвои очки здоровья - {felix.Health} / {felix.MaxHealth}, твоя выносливость - {felix.Stamina} / 20\n" +
                        $"Ты бегло оглядываешь своего противника, пытаясь понять насколько сильно может затянуться драка.\nЕго очки здоровья - {enemy.Health} / {enemy.MaxHealth}, его выносливость - {enemy.Stamina} / 20");
                    Console.ReadKey();
                    Console.Clear();
                    continue;
            }
            felix.AtkAmmount -= 1;
        }
        while (felix.AtkAmmount > 0);
        TurnEnd();

    }
    if (felix.Health <= 0)
    {
        Console.WriteLine("Ты падаешь на пол без сил. Ты, не успевая даже придумать последних слов, чувствуешь как противник наносит свою завершающую атаку и...");
        Console.ReadKey();
        Console.Clear();
        Console.WriteLine(
        "=====================================================================================\n" +
        "=====================================================================================\n" +
        "===■■=======■■=======================■■===========■■=================================\n" +
        "===■■======■■========================■■===========■■=================================\n" +
        "===■■=====■■=========================■■=========■■■■=================================\n" +
        "===■■====■■==========================■■========■■=■■=================================\n" +
        "===■■===■■===========================■■=======■■==■■=================================\n" +
        "===■■==■■============================■■======■■===■■=================================\n" +
        "===■■■■==============================■■=====■■====■■=================================\n" +
        "===■■■■==============================■■====■■=====■■=================================\n" +
        "===■■==■■============================■■===■■======■■=================================\n" +
        "===■■===■■=====■■■■=■==■=■■■■=■==■===■■==■■=======■■=■■■■=■■■==■====■================\n" +
        "===■■====■■====■==■=■==■=■====■==■===■■=■■========■■=■====■==■=■====■================\n" +
        "===■■=====■■===■==■=■■■■=■■■==■==■===■■■■=========■■=■====■==■=■■■■=■================\n" +
        "===■■======■■==■==■=■==■=■====■==■===■■===========■■=■====■■■==■==■=■================\n" +
        "===■■=======■■=■■■■=■==■=■■■■=■■■■■==■■===========■■=■====■====■■■■=■================\n" +
        "==================================■==================================================\n" +
        "=====================================================================================\n" +
        "=====================================================================================\n" +
        "=====================================================================================\n"
        );

    }
    else if (enemy.Health <= 0)
    {
        Console.WriteLine("Ты смог одержать победу в этом сражении.\nТы бы с радостью отпраздновал это, но каждая секунда тебе дорога, и каждый лишний звук может оказаться твоим последним.\nТы двигаешься дальше.");
    }
}
void Traversing()
{
    //доделать систему передвижения после того как будет доделана карта :sob:
    Console.WriteLine("Идти далее?");
    Console.ReadKey();
    layout[3][3] = "[ ]";
    layout[2][2] = "[*]";
}
Console.WriteLine(
    "=====================================================================================\n" +
    "=====================================================================================\n" +
    "===■■■■■■■■======================================■■■■■■==============================\n" +
    "===■■====■■======================================■■====■■============================\n" +
    "===■■====■■======================================■■=====■■===========================\n" +
    "===■■====■■======================================■■====■■============================\n" +
    "===■■====■■======================================■■■■■===============================\n" +
    "===■■====■■======================================■■==================================\n" +
    "===■■====■■======================================■■==================================\n" +
    "===■■====■■======================================■■==================================\n" +
    "===■■====■■======================================■■==================================\n" +
    "===■■====■■=■■■■=■■■■=■■■■=■■■■=■■■■=■=====■■■■==■■======■=====■■■■=■■■■=■■■■========\n" +
    "===■■====■■=■==■=■==■=■====■=====■■==■=====■==■==■■=====■=■====■=====■■==■==■========\n" +
    "===■■====■■=■==■=■=■■=■■■==■=====■■==■■■■==■==■==■■====■===■===■=====■■==■==■========\n" +
    "===■■====■■=■==■=■==■=■====■=====■■==■==■==■==■==■■===■■■■■■■==■=====■■==■==■========\n" +
    "===■■====■■=■■■■=■■■■=■■■■=■■■■==■■==■■■■==■■■■==■■==■=======■=■■■■==■■==■■■■========\n" + 
    "=====================================================================================\n" +
    "=====================================================================================\n" +
    "=====================================================================================\n" +
    "=====================================================================================\n"
    );





